{
  "programName": "AP Statistics Unit 9 Learning Tool",
  "version": "1.0 (Based on provided index.html)",
  "description": "An interactive web page designed to guide students through AP Statistics Unit 9 (Inference for Quantitative Data: Slopes), providing learning resources, practice materials, progress tracking, and integration with the Grok AI assistant.",
  "technologies": [
    {
      "name": "HTML5",
      "role": "Structure and content markup"
    },
    {
      "name": "CSS3",
      "role": "Styling",
      "details": [
        "Tailwind CSS (via CDN) for utility-first styling.",
        "Inline <style> block for custom tab behavior and minor adjustments."
      ]
    },
    {
      "name": "JavaScript (ES6+)",
      "role": "Interactivity, dynamic content, state management",
      "details": [
        "DOM manipulation for tab switching, dynamic content updates.",
        "Event handling for buttons, checkboxes, dropdowns.",
        "Data management for topics and progress.",
        "Interaction with external libraries (React, Mermaid)."
      ]
    },
    {
      "name": "React (v18 via CDN)",
      "role": "UI component for the 'Learning Flow' tab",
      "details": "Used to create the interactive step-by-step guide."
    },
    {
      "name": "ReactDOM (v18 via CDN)",
      "role": "Rendering the React component into the DOM"
    },
    {
      "name": "Babel Standalone (via CDN)",
      "role": "Transpiling JSX used in the React component within the browser."
    },
    {
      "name": "Mermaid JS (via CDN)",
      "role": "Rendering the flowchart diagram from a text-based definition."
    }
  ],
  "components": [
    {
      "name": "Header",
      "selector": "header",
      "description": "Displays the main title, subtitle, and AP exam weight information for the unit.",
      "elements": [
        "h1 (Title)",
        "p (Subtitle)",
        "div (Exam Weight)"
      ]
    },
    {
      "name": "Tab Navigation",
      "selector": ".flex.mb-0.border-b",
      "description": "Allows users to switch between different sections (Learning Flow, Flowchart, Grok Prompt, Study Materials).",
      "elements": [
        "#tab-learning-flow",
        "#tab-flowchart",
        "#tab-grok-prompt",
        "#tab-study-materials"
      ],
      "functionality": "Clicking a tab button updates its style to 'active' and displays the corresponding content section while hiding others. Managed by JavaScript."
    },
    {
      "name": "Tab Content Container",
      "selector": ".bg-white.rounded-b-lg.shadow-md.p-6",
      "description": "Main container holding the content for all tabs.",
      "elements": [
        "#content-learning-flow",
        "#content-flowchart",
        "#content-grok-prompt",
        "#content-study-materials"
      ]
    },
    {
      "name": "Learning Flow Tab",
      "selector": "#content-learning-flow",
      "description": "Displays an interactive step-by-step guide on how to use the learning resources.",
      "elements": [
        "#learning-flow-app (Root element for React component)"
      ],
      "functionality": "Renders the `APStatLearningFlow` React component, which provides navigation through predefined learning steps with tips and material lists."
    },
    {
      "name": "Flowchart Tab",
      "selector": "#content-flowchart",
      "description": "Displays a visual flowchart of the recommended learning process.",
      "elements": [
        "h2 (Title)",
        "p (Description)",
        ".mermaid#flowchart (Container for the Mermaid diagram)",
        "div (Color legend)"
      ],
      "functionality": "Uses Mermaid JS to render a flowchart defined in the `flowchartDefinition` JavaScript variable. Rendering is triggered when the tab becomes active."
    },
    {
      "name": "Grok Prompt Tab",
      "selector": "#content-grok-prompt",
      "description": "Provides the prompt text for the Grok AI tutor, instructions, access to current topic materials, and quick access to all topics.",
      "elements": [
        "h2 (Title)",
        "div (Backup video indicator info)",
        "pre#grok-prompt (Displays the AI prompt)",
        "button#copy-button (Copies prompt to clipboard with visual feedback)",
        "a[href='https://grok.com'] (Link to Grok)",
        "ol (Instructions for using Grok with PDFs)",
        "a[href='https://youtu.be/KPovHIIHfEo'] (Link to video tutorial)",
        "#current-topic-header",
        "#current-topic-info (Dynamically populated with current topic details, PDFs, videos, and checkboxes)",
        "button#complete-current-topic-btn (Marks current topic complete, changes to 'Reset Progress' when all done)",
        ".grok-prompt-topics-header",
        "#quick-access-topics (Dynamically populated with compact cards for all topics, including status and quick links/checkboxes)"
      ],
      "functionality": [
        "Displays a predefined Grok prompt.",
        "Provides a button to copy the prompt.",
        "Dynamically identifies and displays the current topic based on saved progress.",
        "Provides download links for current topic PDFs and links to videos.",
        "Allows marking individual items (videos/quizzes) complete via checkboxes.",
        "Allows marking the entire current topic as complete.",
        "Displays quick access cards for all topics, reflecting completion status and allowing navigation/completion updates.",
        "Handles the 'all completed' state, changing the button to a reset function.",
        "Progress state is loaded from and saved to localStorage."
      ]
    },
    {
      "name": "Study Materials Tab",
      "selector": "#content-study-materials",
      "description": "Lists all study topics for Unit 9 with associated videos and practice PDFs, allowing users to track their progress.",
      "elements": [
        "h2 (Title)",
        "p (Instructions)",
        "div (Backup video indicator info)",
        "#all-completed-container (Message shown when all topics are completed)",
        "button#reset-progress-btn (Resets all saved progress)",
        "div (Grok Prompt CTA Banner)",
        "select#topic-select (Dropdown to jump to a specific topic)",
        "#progress-container > #progress-bar (Visual progress bar)",
        "#topic-cards-container (Dynamically populated with topic cards)",
        "#next-topic-container (Not currently used, hidden)",
        "Topic Card (Dynamically generated for each topic, includes name, description, status icon/badge, video links with checkboxes, PDF links with checkboxes, 'Mark Topic as Completed' button)"
      ],
      "functionality": [
        "Loads progress from `localStorage` on tab activation.",
        "Dynamically generates topic cards based on the `pdfFiles` array and saved progress.",
        "Provides links to AP Classroom videos and backup Google Drive videos (indicated by '(+)').",
        "Provides download links for question and answer PDFs.",
        "Allows users to mark individual videos and quizzes as complete via checkboxes.",
        "Allows users to mark entire topics as complete using a button on the card.",
        "Updates the UI (card styles, progress bar, dropdown) based on completion status.",
        "Saves progress updates to `localStorage`.",
        "Highlights the current topic card.",
        "Locks the capstone topic until all others are complete.",
        "Shows a completion message and reset button when all topics are finished.",
        "Dropdown allows quick navigation to specific topic cards."
      ]
    }
  ],
  "dataSources": [
    {
      "name": "Topic Data (`pdfFiles`)",
      "type": "Inline JavaScript Array",
      "location": "Inline <script> block",
      "description": "Defines the structure of the unit, including topics, descriptions, associated video URLs (primary and backup), quiz PDF paths, unique IDs, and default completion states."
    },
    {
      "name": "Grok Prompt (`grokPrompt`)",
      "type": "Inline JavaScript Variable",
      "location": "Inline <script> block",
      "description": "Stores the text prompt for the Grok AI assistant."
    },
    {
      "name": "Flowchart Definition (`flowchartDefinition`)",
      "type": "Inline JavaScript Variable",
      "location": "Inline <script> block",
      "description": "Stores the Mermaid syntax text defining the flowchart."
    },
    {
      "name": "User Progress",
      "type": "Browser LocalStorage",
      "key": "apStatsUnit9TopicProgress",
      "description": "Persists the completion status of each topic, individual videos, and individual quizzes across browser sessions. Stores topic ID, current status, and detailed completion status/dates for videos and quizzes."
    }
  ],
  "keyFunctionalities": [
    "Tabbed Interface: Organizes content into logical sections.",
    "Learning Flow Guidance: Provides a structured approach to using the tool (React component).",
    "Flowchart Visualization: Offers a visual map of the learning process (Mermaid JS).",
    "Grok AI Integration Support: Provides a specific prompt and easy access to necessary materials (PDFs) for AI tutoring.",
    "Resource Aggregation: Centralizes links to AP Classroom videos, backup videos, and practice PDFs.",
    "Progress Tracking: Allows users to mark individual items (videos, quizzes) and entire topics as complete.",
    "State Persistence: Saves user progress in `localStorage`.",
    "Dynamic UI Updates: Reflects progress visually through card styling, status indicators, and a progress bar.",
    "Current Topic Focus: Automatically highlights the next incomplete topic.",
    "Clipboard Functionality: Easy copying of the Grok prompt.",
    "Responsive Design: Utilizes Tailwind CSS for adaptability to different screen sizes."
  ],
  "dependencies": [
    {
      "type": "CSS Framework",
      "url": "https://cdn.tailwindcss.com"
    },
    {
      "type": "JavaScript Library",
      "name": "React",
      "url": "https://unpkg.com/react@18/umd/react.production.min.js"
    },
    {
      "type": "JavaScript Library",
      "name": "ReactDOM",
      "url": "https://unpkg.com/react-dom@18/umd/react-dom.production.min.js"
    },
    {
      "type": "JavaScript Library",
      "name": "Babel Standalone",
      "url": "https://unpkg.com/@babel/standalone/babel.min.js"
    },
    {
      "type": "JavaScript Library",
      "name": "Mermaid JS",
      "url": "https://cdn.jsdelivr.net/npm/mermaid/dist/mermaid.min.js"
    }
  ],
  "notes": [
    "The application relies heavily on JavaScript for its core functionality, including rendering dynamic content, managing state, and handling user interactions.",
    "Progress tracking is granular, allowing completion marking for individual videos and quizzes.",
    "Error handling for failed resource loading (CDNs) or localStorage issues is not explicitly defined in the provided code.",
    "The (+) icon indicates videos with Google Drive backups, providing resilience against AP Classroom outages."
  ]
}